
REPLY_REGISTRATION = f"""
👋 Приветствуем в proxym1ty!

Мы рады, что вы выбрали нас для безопасного и приватного интернет-серфинга. Перед началом работы позвольте рассказать немного о том, что мы предлагаем:

🔹 Анонимность и безопасность – без лишних вопросов и сложностей
🔹 Быстрая настройка – начните пользоваться в пару кликов
🔹 Подключение по безопасному протоколу Shadowsocks

Нажмите кнопку ниже, чтобы пройти простую регистрацию и начать свое путешествие с Proxym1ty VPN.
"""

PREREGISTRATION_MENU_REPLY = """
👋 Добро пожаловать в меню регистрации Proxym1ty!

Если вы уже наш клиент нажмите кнопку ниже, чтобы активировать ваш аккаунт.

Если у вас пока нет ключа доступа, обратитесь к нашей поддержке, и мы поможем вам с его получением.
"""

REGISTRATION_FSM_REPLY = """
💥 Начнём регистрации Proxym1ty!
Чтобы активировать ваш аккаунт, отправьте ваш ключ от VPN в ответ на это сообщение.
"""
